[{"id":0,"title":"Registration","abstract":"Please arrive early to register, once registered you can mingle and get ready for the keynote.","speakers":[],"begins":"2013-07-22T08:00:00.0000000-04:00","ends":"2013-07-22T09:00:00.0000000-04:00","location":"","vimeoId":""},{"id":1,"title":"Keynote","abstract":"","speakers":[],"begins":"2013-07-22T09:00:00.0000000-04:00","ends":"2013-07-22T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":2,"title":"Authentication Middleware for OWIN","abstract":"Katana 1.1 has shipped with support for self-hosting and authentication middleware that will run on any server. Let's take a look at how that works to have the same cookie authentication and third-party sign-in code work across multiple web frameworks.","speakers":[{"id":1,"name":"Louis DeJardin","twitterHandle":"loudej","bio":"Louis DeJardin works at Microsoft on the web team and is an active member of the OWIN specification working group. Prior to that he worked at Dow Jones creating real-time web-based systems and is the author of the Spark view engine.","headshotUrl":"/images/speakers/louis.jpg"}],"begins":"2013-07-22T10:15:00.0000000-04:00","ends":"2013-07-22T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":3,"title":"Building Windows 8 and Cross-Platform Games using C#, XNA, and MonoGame","abstract":"MonoGame is an open source cross platform implementation of the XNA namespace and class model leveraging the Xamarin framework. The goal of MonoGame is to provide developers with a C#/XNA framework in order build applications that will run Windows 8/Windows RT, Windows Phone 8, and Windows while providing the ability to leverage the same C #/XNA codebase to run natively on the iOS, Android, Mac OS X, and Linux platform with minimal effort. With these goals in mind, come join this talk to learn how to get started and use C# and the XNA framework to build a game on Windows 8 that you can; In the words of MonoGame team \"Write Once, Play Everywhere\".","speakers":[{"id":2,"name":"Tara Walker","twitterHandle":"taraw","bio":"Tara E. Walker is a Technical (Developer) Evangelist in Microsoft’s Developer and Platform Evangelism group.  She has been with Microsoft for 10+ years and is currently based in Atlanta, GA working with software engineers, developers, and students across the Greater Southeast area.   Tara matriculated and graduated from Georgia State University i, and has obtained several Microsoft development and security certifications.\n\nPrior to joining Microsoft, Tara spent 9 years working as a Software Engineer/Developer working with companies like Bellsouth Telecommunications, Time Warner/Turner Broadcasting, and Georgia Pacific on development projects on varying platforms including Unix, Linux,as well as, Microsoft using a variety of programming languages.   As a Technical Evangelist, Tara not only works with the seasoned development and engineering professionals through AL, GA, MS, and FL but also is afforded the opportunity to reach and excite students/faculty about her passions around software engineering, programming, and emerging technologies.  She is currently focused and engaged around on Windows 8 and Windows Phone 8 application/game development, as well as, Cross-Platform development.  She also has experience in Kinect and Azure Mobile Services development.","headshotUrl":"/images/speakers/tara.jpg"}],"begins":"2013-07-22T10:15:00.0000000-04:00","ends":"2013-07-22T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":4,"title":"Community-Driven F#","abstract":"F# isn't just Microsoft's functional programming language any more. The language was open-sourced almost three years ago, and has had tremendous community support since then. During this talk, we'll walk through some of the new features of the language and cover the ongoing community work to build up the language.","speakers":[{"id":3,"name":"Rachel Reese","twitterHandle":"rachelreese","bio":"Rachel Reese is a long-time software engineer and math geek who has recently relocated to the lovely Burlington, Vermont. She runs the local functional programming user group, @VTFun, which is a constant source of inspiration to her, and at which she often speaks on F#. She's also an ASPInsider, a community enthusiast, one of the founding @lambdaladies, and a Rachii. You can find her on twitter, @rachelreese, or on her blog: rachelree.se.","headshotUrl":"/images/speakers/rachel.jpg"}],"begins":"2013-07-22T11:30:00.0000000-04:00","ends":"2013-07-22T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":5,"title":"Orchard, use it or abuse it","abstract":"Orchard is a free, open source (BSD), community-focused Content Management System built on the ASP.NET MVC platform. Orchard can be used out of the box to create any kind of website, but also extended and hacked using the popular ASP.NET MVC and Web API frameworks. Come to see what Orchard has to offer if you intend to create a new website, or simply need inspiration on how to create extensible applications in .NET.","speakers":[{"id":4,"name":"Sébastien Ros","twitterHandle":"sebastienros","bio":"Sébastien lives in Bellevue WA and works at Microsoft in the ASP.NET team as the lead developer on Orchard CMS. Sébastien was born in famous French Bordeaux town, where he started programming at age of 11. In 2001 he co-founded a Microsoft .NET specialized company named Evaluant, where he had been giving training and consultancy services on the .NET platform since then. He has worked on different open source .NET projects like an ORM (http://euss.codeplex.com), a Javascript interpreter (http://jint.codeplex.com) and a mathematical expressions evaluator (http://ncalc.codeplex.com). In parallel he was giving courses at university, teaching software development, web technology and content management.","headshotUrl":"/images/speakers/sebastien_ros.jpg"}],"begins":"2013-07-22T11:30:00.0000000-04:00","ends":"2013-07-22T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":6,"title":"Lunch","abstract":"","speakers":[],"begins":"2013-07-22T12:30:00.0000000-04:00","ends":"2013-07-22T13:30:00.0000000-04:00","location":"","vimeoId":""},{"id":7,"title":"What is new with Mono?","abstract":"Where have we been? Where are we going?","speakers":[{"id":5,"name":"Miguel de Icaza","twitterHandle":"migueldeicaza","bio":"Miguel has directed the Mono project since its creation in 2001 and oversaw the launches of Mono's desktop, server and mobile offerings at Novell. Before Mono he started writing free software in 1992 and co-founded the GNOME project in 1997. In 1999 Miguel co-founded Ximian with Nat. He also worked on the Midnight Commander file manager, Gnumeric, and the Linux kernel. He serves as an advisor at Stack Exchange. He has received the Free Software Foundation 1999 Free Software Award, the MIT Technology Review Innovator of the Year Award in 1999, and was named one of Time Magazine's 100 innovators for the new century in September 2000.","headshotUrl":"/images/speakers/miguel.jpg"}],"begins":"2013-07-22T13:30:00.0000000-04:00","ends":"2013-07-22T14:30:00.0000000-04:00","location":"","vimeoId":""},{"id":8,"title":"Exploring the FubuMVC and Bottles Ecosystem","abstract":"FubuMVC has grown dramatically from its humble beginnings to a sprawling ecosystem of 60+ nuget packages and growing.  In this session we'll explore both the existing library of reusable \"Bottles\" and how FubuMVC's unique modularity strategy allows for so reuse of technical infrastructure across projects.  Along the way we'll show drop-in bottles for RavenDb integration, different authentication strategies, and ready made recipes for using Twitter Bootstrap, Slickgrid, and other client side technologies in side a FubuMVC application or service.","speakers":[{"id":6,"name":"Jeremy Miller","twitterHandle":"jeremydmiller","bio":"Jeremy is a software developer at Extend Health.  Jeremy began his IT career writing \"Shadow IT\" applications to automate his engineering documentation, then wandered into software development because it looked like more fun. Jeremy is the author of the open source StructureMap tool for Dependency Injection with .Net, StoryTeller for supercharged acceptance testing in .Net, and the technical leader of FubuMVC.","headshotUrl":"/images/speakers/jeremy.jpg"}],"begins":"2013-07-22T14:45:00.0000000-04:00","ends":"2013-07-22T15:45:00.0000000-04:00","location":"","vimeoId":""},{"id":9,"title":"Automating C# Binding Creation","abstract":"Bindings are an essential tool for application developers, allowing access to native system and utility libraries through managed assemblies and languages. Creating them is hard work, however, and they require constant attention to keep them up to date and in synch with the native library they are providing access to. In recent years, the number of available and up to date bindings on the Linux/Gnome desktop has fallen, due mainly to the lack of skilled and willing people to create and maintain them. What if we could automate the process of creating and updating bindings? This is the question that has led to the creation of a new tool - called Bindinator - to automate managed binding creation targetting Gnome libraries, which will be the focus of this talk. We'll see how it works and how it hooks up into the development process. With practical examples, you'll see how easy it is to go from a native library to a fully featured managed binding in just a few simple steps.","speakers":[{"id":7,"name":"Andreia Gaita","twitterHandle":"sh4na","bio":"Andreia Gaita is a Mono developer working at Unity Technologies and hailing from the sunny city of Lisbon, Portugal.\n\nFor the past 14 years she has been involved in the development of applications, services and libraries that deal with interoperability, cross-platform and the web.\n\nFor the last seven she has been working on several different areas of the Mono project, from implementing Moonlight, Winforms and gluezilla to improving C++ support, embedding browser engines and bindings.\n\nRecenly, she's been busying herself with game-related development and with supporting the Mono community and making sure it thrives.","headshotUrl":"/images/speakers/andreia_gaita.jpg"}],"begins":"2013-07-22T14:45:00.0000000-04:00","ends":"2013-07-22T15:45:00.0000000-04:00","location":"","vimeoId":""},{"id":10,"title":"Asynchronous Application Patterns in C#","abstract":"Now that Mono 3.0 supports the await keyword in C# we finally have an excuse to go back and rewrite all our networking code. Wait, no, nevermind, don't do that.\n\nInstead, let's explore ways to write new code that takes advantage of this new syntax. We will look at common mobile app user experiences and see how we can use await and async code to create them. And maybe, just maybe, we'll write some networking code along the way.\n\nAfter we're all bored with the practical uses of await, let's take a quick glance at some more advanced - exotic - ridiculus? - uses of the syntax to enable new experiences.","speakers":[{"id":8,"name":"Frank Krueger","twitterHandle":"praeclarum","bio":"Frank has been developing with Xamarin.iOS for 4 years and has loved every minute of it. He has released a bunch of apps and thankfully some of them even sell well. He also likes to contribute to open source since doing so seems to be in vogue and it's fun to play with git. If you buy him a drink, he will tell you how to architect your app for cross platform development, pros and cons of different UIs, robotics, or funny things to do with expression trees and Mono.Cecil.","headshotUrl":"/images/speakers/frank.jpg"}],"begins":"2013-07-22T16:00:00.0000000-04:00","ends":"2013-07-22T17:00:00.0000000-04:00","location":"","vimeoId":""},{"id":11,"title":"Extending Glimpse - The Black Belt Edition","abstract":"Glimpse is an open source diagnostics platform born out of the realization that insights into the inner workings of web development frameworks can be difficult to come by. Since going live it has proven successful on the ASP.NET stack and prototype implementations have been built for PHP and Python. Additionally, the possibility of being able to move beyond simple console.log statements in client side JavaScript frameworks has many developers excited.\n\nJoin the core Glimpse development team for an architectural deep dive which will cover the platform top to bottom. Starting with the wider ecosystem, find out how the server and client interact, as well as the abstractions that compose this heterogeneous system. From there, learn how extensions can be built to bring advanced diagnostics to various libraries and frameworks built on .NET and finish by leveraging the Glimpse browser client to expose JavaScript framework diagnostics.","speakers":[{"id":9,"name":"Nik Molnar","twitterHandle":"nikmd23","bio":"Nik Molnar is a New Yorker, ASP Insider and co-founder of Glimpse, an open source ASP.NET diagnostics and debugging tool. Originally from Florida, Nik specializes in web development, building scalable client-centric solutions. In his spare time, Nik can be found cooking up a storm in the kitchen, hanging with his wife, speaking at conferences, and working on other open source projects.","headshotUrl":"/images/speakers/nik.jpg"},{"id":10,"name":"Anthony van der Hoorn","twitterHandle":"anthony_vdh","bio":"Anthony van der Hoorn is a co-founder of Glimpse, and regular speaker on such topics as Open Source and Web Practices. Since starting his career, Anthony has specializing in web and front end development with technologies such as JavaScript, CSS, and HTML.Anthony, has spent the last two years living and working New York City, and is now back has home town of Brisbane, Australia. During his time in the Big Apple, he worked in the Financial Services sector developing high frequency trading systems. In his spare time, Anthony can be caught out and about taking photos, speaking at conferences, and working on other Open Source projects.","headshotUrl":"/images/speakers/anthony.jpg"}],"begins":"2013-07-22T16:00:00.0000000-04:00","ends":"2013-07-22T17:00:00.0000000-04:00","location":"","vimeoId":""},{"id":12,"title":"Building hybrid mobile apps with C# and Razor","abstract":"This talk will demonstrate how to use Xamarin to build hybrid mobile apps that mix native controls and HTML content. It will show how to use the open source Razor ASP.NET view engine as a standalone templating system for generating HTML in Android and iOS applications. The talk will also cover best practices for hybrid app development and techniques for faciliting communication between C# and embedded HTML content in Xamarin mobile applications.","speakers":[{"id":11,"name":"Ryan Paul","twitterHandle":"segphault","bio":"Ryan Paul is a Developer Evangelist at Xamarin, a startup dedicated to building better mobile development tools. Ryan is also a Linux enthusiast and open source software developer. Prior to joining Xamarin, he was a contributing editor at Ars Technica, where he wrote articles about software development. Ryan spends his free time stockpiling ammunition in preparation for the inevitable Roomba insurrection.","headshotUrl":"/images/speakers/ryan.jpg"}],"begins":"2013-07-22T17:15:00.0000000-04:00","ends":"2013-07-22T18:15:00.0000000-04:00","location":"","vimeoId":""},{"id":13,"title":"Evolution of NuGet","abstract":"NuGet is evolving to be much more than a Visual Studio extension used only for ASP.NET applications.  Come see how NuGet can be used cross-platform and in new scenarios.","speakers":[{"id":12,"name":"Jeff Handley","twitterHandle":"jeffhandley","bio":"Jeff Handley is a Development Lead at Microsoft working on NuGet.  He has also worked on ASP.NET Web Pages, Razor, Azure, and WCF RIA Services.  Before joining Microsoft in 2008, Jeff spent over 10 years in the field developing and architecting web applications.","headshotUrl":"/images/speakers/jeff.jpg"}],"begins":"2013-07-22T17:15:00.0000000-04:00","ends":"2013-07-22T18:15:00.0000000-04:00","location":"","vimeoId":""},{"id":14,"title":"Your First Multi-Platform Game Using MonoGame","abstract":"An introduction to creating a game using monogame with a focus on ensuring multi-platform capability. Learn how to draw sprites, 3d models, and text on the display, and finally play background music and sound effects.","speakers":[{"id":13,"name":"Michael Cummings","twitterHandle":"mcummings","bio":"Michael is a Technology Evangelist for Microsoft in the New England District. He is passionate about all technologies, with a current focus on Mobile solutions.\n\nMichael is a developer and architect with experience in app development, infrastructure design & deployment and business process as it relates to technology. He is an MVP and holds multiple certifications from Microsoft and other certifying organizations, including MCP, MCT, MCSD, MCSE, and MCDBA.\n\nMichael has been a graphics and game programmer since the days of the TI99-4/A. He started the Boston XNA Developers Group and is a sought after speaker on XNA, MonoGame and cross platform mobile app development. He has contributed to many open source projects, including AXIOM, a .NET/Mono 3D rendering engine and Planeshift  a 3D MMORPG. Michael also has experience with native game and graphics development (C++/DirectX) on Windows.","headshotUrl":"/images/speakers/michael_cummings.jpg"}],"begins":"2013-07-23T09:00:00.0000000-04:00","ends":"2013-07-23T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":15,"title":"Dependency Management in .Net OSS Development","abstract":"For years and years OSS developers in .Net looked with envy at the thriving OSS environments in other languages and platforms.  Then came Nuget to finally give us a de facto standard for packaging and dependency management and it allowed us to hit a wall faster.  In this session I'll share the very hard lessons the FubuMVC community has learned about using Nuget and TeamCity to do multi-platform dependency management in a large ecosystem on both Windows and Mono on Linux.  I'll present our ripple tool we use to quickly and reliably move upstream dependencies to downstream projects.","speakers":[{"id":6,"name":"Jeremy Miller","twitterHandle":"jeremydmiller","bio":"Jeremy is a software developer at Extend Health.  Jeremy began his IT career writing \"Shadow IT\" applications to automate his engineering documentation, then wandered into software development because it looked like more fun. Jeremy is the author of the open source StructureMap tool for Dependency Injection with .Net, StoryTeller for supercharged acceptance testing in .Net, and the technical leader of FubuMVC.","headshotUrl":"/images/speakers/jeremy.jpg"}],"begins":"2013-07-23T09:00:00.0000000-04:00","ends":"2013-07-23T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":16,"title":"Reach the Mobile Masses with ASP.NET MVC 4 and jQuery Mobile","abstract":"Creating web applications that will target multiple devices and platforms has become the web developers Holy Grail. Simple HTML pages render without issue no matter what browser or device they are viewed on but who codes simple HTML pages? What happens when you have a business need to hit all mobile platforms? You don't have to write hundreds of lines of code to make this happen!\n\nIn this talk Keith will demonstrate how using the latest version of ASP.NET MVC, MVC4, and jQuery Mobile allows you to develop web applications that target iPhone, iPad, Android, Windows Phone 7, and even Blackberry without having to code and style each platform separately.","speakers":[{"id":14,"name":"Keith Burnell","twitterHandle":"keburnell","bio":"Keith Burnell is a Microsoft MVP in ASP.NET/IIS and Senior Software Engineer with Skyline Technologies.  He has been developing software for over 10 years specializing in large scale ASP.NET and ASP.NET MVC web site development and architecture as well as teaching and mentoring clients on the benefits of test-driven development.\n\nKeith is an active member of the .NET community who speaks regularly at local and regional user groups and developer events as well as at national conferences. He is an avid blogger and author who been featured multiple times in MSDN magazine and has authored courses for Pluralsight.\n\nKeith has two wonderful daughters and is married to his high school sweetheart who is still way out of his league!\n\nWhen not slinging code, Keith enjoys spending time with his family, karate, golf, and woodworking.\n\nKeith can be found on his Blog, Twitter, and GitHub.","headshotUrl":"/images/speakers/keith.jpg"}],"begins":"2013-07-23T10:15:00.0000000-04:00","ends":"2013-07-23T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":17,"title":"Secrets of Mono performance tuning.","abstract":"Have you ever found a piece of C# code that is supposed to be fast, but it's slow under mono? In this talk we'll walk through a few common performance pitfalls on the mono runtime and how to optimize code targeting it.","speakers":[{"id":15,"name":"Rodrigo Kumpera","twitterHandle":"kumpera","bio":"Rodrigo Kumpera is a mono hacker for over half a decade having contributed to sandboxing, SIMD and, more recently, to the new garbage collector.","headshotUrl":"/images/speakers/rodrigo.jpg"}],"begins":"2013-07-23T10:15:00.0000000-04:00","ends":"2013-07-23T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":18,"title":"Cross-Platform Game Development with C# and MonoGame","abstract":"XNA gave us the promise of cross-platform (within the Microsoft world) game development. MonoGame takes that promise and adds it to Xamarin 2.0 to give you the ability to port your game to nearly every device in existence: WinRT, WP8, iOS, Android, Mac, Linux, and more!\n\nThe talk will start with an introduction to game concepts like the Game Loop. From there Xamarin and Mono will be introduced to show the basics of using \".NET\" and C# on non-Windows platforms. MonoGame and XNA will be introduced next starting with each ones history and then moving on to using both. Finally problems that can come up when developing MonoGame/XNA for cross platform games.","speakers":[{"id":16,"name":"Shmueli Englard","twitterHandle":"shmuelie","bio":"Shmueli Englard is a C# developer in New Jersey who like to push the boundaries of what we think we can. He currently works for a startup called Control Influence doing niche market software and in his spare time helps promote Microsoft technologies and MonoGame.","headshotUrl":"/images/speakers/shmuelie.jpg"}],"begins":"2013-07-23T11:30:00.0000000-04:00","ends":"2013-07-23T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":19,"title":"Advanced HTTP Caching & Patterns for Ninja Unicorns","abstract":"You know the basics of HTTP caching. Setting HTTP expiries on a document has no secret for you, you know how to prevent a browser from caching dynamic content and you're pretty happy with If-Modified-Since. In this session, you will discover the actual difference between strong and weak etags, how to invalidate URIs, use reverse-proxies efficiently and how much freedom the client has in overriding defaults and bossing proxies around. And if you are worried of learning all this on your own, fear not, an old friend will be there learning with us.","speakers":[{"id":17,"name":"Sebastien Lambla","twitterHandle":"serialseb","bio":"Sebastien Lambla runs Caffeine IT, a consultancy helping clients from all over Europe implement first-grade and nnovative solutions, from brushing up software design skills to implementing enterprise-ready resource-oriented architectures. In his spare time, Sebastien writes a book on ReST, contributes to OSS projects, and is still in a secret love affair with javascript and nodejs.","headshotUrl":"/images/speakers/sebastien_lambla.jpg"}],"begins":"2013-07-23T11:30:00.0000000-04:00","ends":"2013-07-23T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":20,"title":"Lunch","abstract":"","speakers":[],"begins":"2013-07-23T12:30:00.0000000-04:00","ends":"2013-07-23T13:30:00.0000000-04:00","location":"","vimeoId":""},{"id":21,"title":"Top Secret Announcement","abstract":"Make sure you join Scott and Chris as they make an awesome announcement.","speakers":[{"id":18,"name":"Scott Hanselman","twitterHandle":"shanselman","bio":"Scott Hanselman works for Microsoft as Principal Community Architect for Web Platform and Tools, aiming to spread the good word about developing software, most often on the Microsoft stack. Before this he was the Chief Architect at Corillian Corporation, now a part of Checkfree. For 6+ years and before that he was a Principal Consultant at STEP Technology for nearly 7 years. He was also involved in a few things Microsoft-related like the MVP and RD programs and will speak about computers (and other passions) whenever someone will listen to him. He's written in a few books, most recently with Bill Evjen and Devin Rader on Professional ASP.NET. He blogs at http://www.hanselman.com for the last 8 years and podcasts weekly at http://www.hanselminutes.com and http://www.thisdeveloperslife.com.","headshotUrl":"/images/speakers/scott_hanselman.jpg"},{"id":19,"name":"Chris Walker","twitterHandle":"chrisdwalker","bio":"Chris Walker is the founder of Secret Labs LLC and inventor of the Netduino.","headshotUrl":"/images/speakers/chris_walker.jpg"}],"begins":"2013-07-23T13:30:00.0000000-04:00","ends":"2013-07-23T14:30:00.0000000-04:00","location":"","vimeoId":""},{"id":22,"title":"MonoGame - Draw a Stickman: EPIC","abstract":"Come learn how Draw a Stickman leverages MonoGame to develop a successful cross-platform game. Draw a Stickman is currently available for iOS, Mac, Windows 8, Windows Phone 7 & 8, Android, and Kindle (Amazon store) and is approaching 2 million downloads on all platforms.","speakers":[{"id":20,"name":"Jonathan Peppers","twitterHandle":"jonathanpeppers","bio":"Lead developer on Draw a Stickman: EPIC, lead developer of apps at Hitcents.com where we do custom software development of all kinds.\n\nWe also developed the sample apps for Xamarin here: http://xamarin.com/prebuilt/fieldservice\n\nWe have had multiple apps reach the top of the charts and getting millions of downloads including Draw a Stickman Episode 1, 2, and EPIC as well as the Harlem Shake.","headshotUrl":"/images/speakers/jonathan_peppers.jpg"}],"begins":"2013-07-23T14:45:00.0000000-04:00","ends":"2013-07-23T15:45:00.0000000-04:00","location":"","vimeoId":""},{"id":23,"title":"From One to One-Hundred: Building Your Project Community","abstract":"All open source projects would like to have to more contributors but how do you recruit them and keep them involved? Eric Schultz, Developer Advocate from Outercurve Foundation, will teach you practical methods of encouraging users to get involved and keeping contributors engaged. You’ll leave with concrete steps you can take to strengthen your project’s community.  Whether you’re just starting a project, your project’s contributor growth has stagnated or you just want to keep your project community vibrant, you’ll learn what practices have worked for OSS communities and what practices to avoid. Find out how to translate those interested to users and users to contributors.","speakers":[{"id":21,"name":"Eric Schultz","twitterHandle":"EricOutercurve","bio":"Eric recently worked with Microsoft’s Open Source Technology Center on the CoApp project of which he’s a long time committer. Prior to this project, he was a Software Engineer on Mercury Marine’s G3 team which develops and maintains Mercury’s computer diagnostic system for marine engines. Eric is a 2011 graduate of the University of Wisconsin-Oshkosh where he majored in Computer Science.  Eric passionately believes in the power of free, libre and open source software to improve the lives of developers and end-users. He regularly uses Google Chrome, Git (primarily via Github) and will tell anyone willing to listen that using LINQ will change your life.","headshotUrl":"/images/speakers/eric_schultz.jpg"}],"begins":"2013-07-23T14:45:00.0000000-04:00","ends":"2013-07-23T15:45:00.0000000-04:00","location":"","vimeoId":""},{"id":24,"title":"The Anti-Abstraction: Why We Shouldn't Leave Everything Up To Magic","abstract":"Knowledge abstraction and specialization are two choices we make every day to increase our productivity. But what are we missing when we take the \"code first, ask questions later\" approach? In this session, we will take a wild romp through technology and science as we learn what C# has to teach us about the brain, decipher some of the mysteries behind Xamarin, and fall boldly down the rabbit hole that emerges when we keep on asking: \"how does that work?\".","speakers":[{"id":22,"name":"Nina Vyedin","twitterHandle":"misskallisto","bio":"Nina started her hacking career working on our future robot overlords, which lead her to C# and eventually to Xamarin. She joined Xamarin’s documentation team a year and a half ago as an intern, and has been hanging on for dear life ever since. When she is not writing code or docs, she can be found making music, wrangling unicorns, or curating her ever-growing collection of sunglasses.","headshotUrl":"/images/speakers/nina.jpg"}],"begins":"2013-07-23T16:00:00.0000000-04:00","ends":"2013-07-23T17:00:00.0000000-04:00","location":"","vimeoId":""},{"id":25,"title":"Understanding XBuild","abstract":"XBuild is the open source implementation of MSBuild and is slowly becoming the default build tool for mono based projects. In this presentation we'll cover some of the basic ideas and concepts of XBuild and how we can take advantage of its features.","speakers":[{"id":23,"name":"Stephen Shaw","twitterHandle":"decriptor","bio":"I am a husband, father, and software developer. I spent many years in the Linux world and now do mobile development. Currently I work for Xactware's Xactimate Mobile team doing android and using Xamarin's tools.","headshotUrl":"/images/speakers/stephen_shaw.jpg"}],"begins":"2013-07-23T16:00:00.0000000-04:00","ends":"2013-07-23T17:00:00.0000000-04:00","location":"","vimeoId":""},{"id":26,"title":"Intro to F# pattern matching","abstract":"F# lends itself very well to hard problems. The ability to express computations elegantly using types and pattern matching is something that turns complicated algorithms into very readable and flexible constructs.\n\nIn this talk I'll show you how I implemented the scheme language in F# and specifically how f# pattern matching turned what would be verbose hairy code in some languages to an expressive concise flexible thing of joy. F# newcomers welcome!","speakers":[{"id":24,"name":"Stephen Olsen","twitterHandle":"olsenator4","bio":"Stephen is a functional programming enthusiast. He used to write c# and plays with a variety of languages (f# included) for fun. He is a clojure developer at Arc90.","headshotUrl":"/images/speakers/stephen_olsen.jpg"}],"begins":"2013-07-23T17:15:00.0000000-04:00","ends":"2013-07-23T18:15:00.0000000-04:00","location":"","vimeoId":""},{"id":27,"title":"SOLID programming with portable class libraries","abstract":"Developers often don't pay attention to code portability until they need to target multiple platforms. However, large amount of non-portable code often hints about violation of clean code principles, so it is worth investigating which part of the source code base are platform-specific and for what reasons.\n\nIn this session we will give an overview of portable class libraries, show how to extract PCL components from a real-world application and go through typical challenges that are faced when writing portable code. We will present the original tool that analyzes assemblies for portability compliance and can be used as a guard to prevent mixing business logic with infrastructure-specific functionality. Finally we will demonstrate how PCLs help targeting platforms such as Windows Store, Android and iOS.","speakers":[{"id":25,"name":"Vagif Abilov","twitterHandle":"ooobject","bio":"Vagif Abilov is working for a Norwegian company Miles. He has more than twenty years of programming experience that includes various programming languages, currently using mostly C# and F#.\n\nVagif writes articles and speaks at user group sessions and conferences. He is a contributor to several open source projects, such as SpecFlow and Simple.Data, and a maintainer of Simple.Data.OData, Simple.OData.Client and MongOData.","headshotUrl":"/images/speakers/vagif.jpg"}],"begins":"2013-07-23T17:15:00.0000000-04:00","ends":"2013-07-23T18:15:00.0000000-04:00","location":"","vimeoId":""},{"id":28,"title":"Advanced Collection Views","abstract":"This session will cover how to create custom layouts using Collection Views. After a brief overview of Collection Views and the stock flow layouts that enable grid-like user interfaces, we will delve into more advanced layout scenarios. We'll show how to subclass flow layouts to deliver line-based layouts that enable rich user experiences. Then we will show how to diverge from flow layouts altogether to create and interact with entirely customized layouts.","speakers":[{"id":26,"name":"Michael Bluestein","twitterHandle":"mikebluestein","bio":"Michael is a technical writer for Xamarin. He has worked with iOS since the first iPhone SDK and Xamarin.iOS since the first beta of MonoTouch. He is also author of the book “Learning MonoTouch.” Previously Michael has created engineering software at Dassault Systèmes and designed turbomachinery for Pratt & Whitney.","headshotUrl":"/images/speakers/michael_bluestein.jpg"}],"begins":"2013-07-24T09:00:00.0000000-04:00","ends":"2013-07-24T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":29,"title":"Introducing Nonacat (Guerilla Hacking an Extra Arm onto GitHub)","abstract":"GitHub, as instrumental as it is, knows that they cannot possibly offer a one-size-fits-all service that meets the needs to every OSS project. With that in mind, come join Nik Molnar, co-founder of Glimpse, for a session on how to extend GitHub by leveraging their API’s, cutting edge web technologies and free/open source tools to provide users, contributors and project maintainers with a better overall experience.\n\nThis session is not about Git itself and is suitable for OSS project maintainers and all users of GitHub.","speakers":[{"id":9,"name":"Nik Molnar","twitterHandle":"nikmd23","bio":"Nik Molnar is a New Yorker, ASP Insider and co-founder of Glimpse, an open source ASP.NET diagnostics and debugging tool. Originally from Florida, Nik specializes in web development, building scalable client-centric solutions. In his spare time, Nik can be found cooking up a storm in the kitchen, hanging with his wife, speaking at conferences, and working on other open source projects.","headshotUrl":"/images/speakers/nik.jpg"}],"begins":"2013-07-24T09:00:00.0000000-04:00","ends":"2013-07-24T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":30,"title":"F# in Action: Playing Functional Conway's Game of Life","abstract":"John Conway's game of life has become a playground for programmers using different languages and platforms. It inspired many coding dojos and code retreats because it touches various aspects of development from component design to performance testing.\n\nIn this session we are going to take functional approach and play different variations of Conway's game of life using F#. The session starts with presentation of a traditional game implementation in C#, so we can later compare it with F# versions. Switching to F#, we will proceed with the following exercises:\n\nMain theme (standard two-dimensional board), Multi-dimensional variations (even boards of arbitrary dimensions), Concurrent variations (asynchronous workflows and parallel tasks), Visualization of Conway's game of life, Song time: \"Living with no sense of monad\"","speakers":[{"id":25,"name":"Vagif Abilov","twitterHandle":"ooobject","bio":"Vagif Abilov is working for a Norwegian company Miles. He has more than twenty years of programming experience that includes various programming languages, currently using mostly C# and F#.\n\nVagif writes articles and speaks at user group sessions and conferences. He is a contributor to several open source projects, such as SpecFlow and Simple.Data, and a maintainer of Simple.Data.OData, Simple.OData.Client and MongOData.","headshotUrl":"/images/speakers/vagif.jpg"}],"begins":"2013-07-24T10:15:00.0000000-04:00","ends":"2013-07-24T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":31,"title":"Debugging and Performance Tips for .Net and Mono","abstract":"You have an application that uses managed code; maybe even one running on multiple platforms. Your managed language of choice is so productive that the team is churning out tons of code every day. Your user base is growing and pushing your application in ways you never imagined. Success! Then the crash bugs start rolling in. And snappiness gives way to sluggishness.\n\nThis talk will cover how to debug and profile your managed application, both on .Net and mono. What tools are available, general approaches, gotchas to avoid, supporting .Net and mono, etc.","speakers":[{"id":27,"name":"Jonathan Chambers","twitterHandle":"jon_cham","bio":"Jonathan Chambers is a Software Developer at Unity Technologies. He focuses on all things C/C++/C# in the Unity3d game engine, with a special love for making managed and native code communicate. He's been contributing to mono for years in a variety of different areas.","headshotUrl":"/images/speakers/jonathan.jpg"}],"begins":"2013-07-24T10:15:00.0000000-04:00","ends":"2013-07-24T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":32,"title":"Dive into parser combinators with F# and FParsec","abstract":"Stop using write-once, readable-never regexes in F# when you could be using parser combinators, a beautiful and elegant way to express a language's grammar. Make your C# friends jealous by mastering one of the libraries that wields the unique strengths of F# for truth, beauty, and strings. We'll cover everything from theory to practice, drawing from my experience on the Kiln team at Fog Creek Software. Hold my hands, let's learn hardcore.","speakers":[{"id":28,"name":"Hao Lian","twitterHandle":"","bio":"I work on Kiln (plug: source control for pros) at Fog Creek Software in NYC. I remember being in middle school and being so confused about what Ruby on Rails did, back when it was first released, back when the only documentation was the intro video and the auto-generated HTML from the source code's docstrings. Back when blogs were cool. I have a BSE in Computer Science from Princeton University; therefore I am a computer scientist. I live in Brooklyn. I think Neutral Milk Hotel is one of the greatest bands of all time. I've always wanted to make a movie.","headshotUrl":"/images/speakers/hao_lian.jpg"}],"begins":"2013-07-24T11:30:00.0000000-04:00","ends":"2013-07-24T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":33,"title":"DIY Testing for the OSS Developer","abstract":"It's a rare open source project that has dedicated, expert testers; most often, we (the developers) must test what we make on our own.\n\nI want to help you test better, by showing how to apply the same degree of discipline and craftsmanship we use to make software, to testing it. I'll cover topics like: Letting context drive all testing; Test preparation and planning; Rapid, but disciplined, testing; When to keep test notes; Deciding what tests to automate; The skill of testing, and how to improve it; Getting help when it's needed; GitHub tips and tricks for testing\n\nWhen we're done, you'll be a better tester, and you'll know how to keep improving.","speakers":[{"id":29,"name":"Drew Miller","twitterHandle":"halfogre","bio":"I'm half ogre, half role-playing game and comic book dork, and I work at GitHub making and testing software. Before that I made and tested software at Microsoft, working on projects like MSDN, CodePlex, ASP.NET MVC, and NuGet.\n\nTesting and OSS make me happy.","headshotUrl":"/images/speakers/drew_miller.jpg"}],"begins":"2013-07-24T11:30:00.0000000-04:00","ends":"2013-07-24T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":34,"title":"Lunch","abstract":"","speakers":[],"begins":"2013-07-24T12:30:00.0000000-04:00","ends":"2013-07-24T13:30:00.0000000-04:00","location":"","vimeoId":""},{"id":35,"title":"Open Source Apocalypse: Imagining .NET Open Source in Our Hands","abstract":"There’s a lot of angst in the .NET open source community about the relative lack of maturity when compared to thriving open source communities such as the Ruby and Node communities.\n\nMany blame the effects of large corporate influence such as that of a certain a very large company in the pacific northwest. The claim is that when the titan releases substandard open source projects, it sucks the air from all existing projects in the same space. Is this true?\n\nLet’s imagine a world in which this company suddenly ceases to exist. Would your .NET OSS project still be relevant? Would it survive on its own merits without a large corporation bolstering .NET?\n\nPerhaps it’s time to put responsibility for the success of our projects in our own hands and not leave it to chance or the whims of a large corporation.\n\nCome learn some tips on navigating a world where a large corporation is involved in .NET OSS (hint, it’s been done before) and how to create a project that can stand on its own in the presence of an 800lb gorilla.\n\nSome topics covered include: Getting people interested in your project; Cultivating contributors; Licenses and Lawyers; Leveraging foundations","speakers":[{"id":30,"name":"Phil Haack","twitterHandle":"haacked","bio":"Phil Haack (yes, it's pronounced \"hack\") works at GitHub finding ways to make it better for .NET and Windows developers everywhere. Prior to GitHub, he was a senior Program Manager at Microsoft responsible for shipping ASP.NET MVC, NuGet, among other projects. These projects were released under open source licenses and helped served as examples of the open source model for shipping software to other teams at Microsoft.\n\nPhil is a co-author of the popular Professional ASP.NET MVC series and regularly speaks at conferences around the world. He's also made several appearances on technology podcasts such as .NET Rocks, Hanselminutes, Herding Code, and The Official jQuery Podcast.","headshotUrl":"/images/speakers/phil.jpg"}],"begins":"2013-07-24T13:30:00.0000000-04:00","ends":"2013-07-24T14:30:00.0000000-04:00","location":"","vimeoId":""},{"id":36,"title":"MonoDevelop Internals","abstract":"MonoDevelop is an open source IDE built with C# and GTK#. The session will start with an overview of the MonoDevelop architecture, and will explain the challenges faced and decisions made while designing the different services and components. I will also explain in some detail how the services that implement the IDE work internally, and how they are integrated.","speakers":[{"id":31,"name":"Lluis Sanchez","twitterHandle":"slluis","bio":"I've been involved in the Mono project for more than 10 years. I worked in several areas of the Mono libraries (Remoting, Serialization, Web Services) before moving to work full time on the MonoDevelop IDE. I'm currently the lead of the Xamarin Studio team at Xamarin.","headshotUrl":"/images/speakers/lluis.jpg"}],"begins":"2013-07-24T14:45:00.0000000-04:00","ends":"2013-07-24T15:45:00.0000000-04:00","location":"","vimeoId":""},{"id":37,"title":"Unifying APIs with Xamarin.Mobile","abstract":"Xamarin.Mobile is a unified API that can be used to use device specific functionality, such as Contacts, Location and Photo taking. This allows you to use almost exactly the same API on iOS, Android, Windows Phone and Windows 8 and the project needs your help! Find out how the Xamarin.Mobile API works under the hood, how you can take the code and extend it for use within your own apps and also how you can contribute back to the project.","speakers":[{"id":32,"name":"Chris Hardy","twitterHandle":"chrisntr","bio":"Chris Hardy, a Microsoft ASPInsider, is an C# consultant focusing on Xamarin.iOS, Xamarin.Android and Windows Phone/8 development.\n\nEver since MonoTouch was in beta, Chris has been developing and evangelising MonoTouch and was one of the first users to get a MonoTouch application on to the App Store. Speaking at conferences around the world on the subject, Chris has been a key part of the community and extended this by contributing to MonoTouch and Mono for Android books.","headshotUrl":"/images/speakers/chris.jpg"}],"begins":"2013-07-24T14:45:00.0000000-04:00","ends":"2013-07-24T15:45:00.0000000-04:00","location":"","vimeoId":""},{"id":38,"title":"Extending Xamarin Studio with Add-ins","abstract":"The Xamarin Studio / MonoDevelop add-in model allows deep customization and extension of the IDE, from the addition of simple text editing commands to plugging in new project types and languages. This talk introduces the add-in model and provides a broad overview of the MonoDevelop architecture and the APIs, services and extension points that add-ins can use. It concludes with an explanation of the add-in build server and the mechanisms for publishing and distributing add-ins.","speakers":[{"id":33,"name":"Michael Hutchinson","twitterHandle":"mjhutchinson","bio":"Michael has been a core contributor to the MonoDevelop IDE since the 2006 Google Summer of Code. At Novell he was responsible for developing the IDE tooling for Mono's web, mobile and Mac technologies. In 2011, Michael joined Xamarin to help make Xamarin Studio the best IDE for mobile development.","headshotUrl":"/images/speakers/michael.jpg"}],"begins":"2013-07-24T16:00:00.0000000-04:00","ends":"2013-07-24T17:00:00.0000000-04:00","location":"","vimeoId":""},{"id":39,"title":"Hero - Saving Projects from Role Based Authorization","abstract":"Hero is an ability based authorization library for .NET MVC and WepAPI projects inspired by the Rails project CanCan and by Derick Bailey. Ability (or activity) based authorization provides a more flexible and maintainable approach to the traditional .NET authorization technique. Hero decouples the permissions and the code. By associating a role to a method or action in .NET (through typical Authorization attribute) a tight coupling between a role and an action is created. However, what happens when a role name changes? What if new roles are added? Now all code that references that role must be updated. Instead, if ability names are assigned to an action or method the functionality and the permissions are abstracted. This allows for a loose coupling between functionality and roles/users. When the user and roles requirements change only one section of code needs to be updated rather than going through the entire project updating those tight couplings. Permissions are effectively encapsulated within a single, refactorable file similar to the ability.rb in CanCan.","speakers":[{"id":34,"name":"Eric LaForce","twitterHandle":"elaforc","bio":"Eric is a lead software developer at a custom development shop in Charlotte, NC called Skookum Digital Works. He has been building .NET and Rails projects for 7 years. He loves the Rails open source community and is excited to help the .NET stack achieve the same level of openness and collaboration.","headshotUrl":"/images/speakers/eric_laforce.jpg"}],"begins":"2013-07-24T16:00:00.0000000-04:00","ends":"2013-07-24T17:00:00.0000000-04:00","location":"","vimeoId":""},{"id":40,"title":"Cross Platform Responsible Connected Apps","abstract":"Anyone with a phone knows that despite widespread coverage cellular connections are spotty and often slower and weaker than what we hope.\n\nAre your apps one of the few that responsibly handles connectivity issues and manages delays and stale data for the user?  Based upon experiences designing and deploying applications in areas hit by natural disasters, we will discuss best practices and strategies for coding these responsible applications across mobile platforms that minimize data transferred, connection delays, store and forward uploads and requests, and use fallback technologies, like SMS, that are more likely to work in limited connectivity scenarios.  To help you build consistent user experiences across device platforms we will focus on implementations with C# and .NET, leveraging open source frameworks and Mono/Xamarin across Windows Phone, Windows 8 and iOS & Android apps.","speakers":[{"id":35,"name":"Tony Surma","twitterHandle":"tonysurma","bio":"Tony Surma is the CTO of Microsoft’s Disaster Response program which is responsible for the development and deployment of Microsoft and their partners' technologies to enable response organizations’ critical relief efforts and connect communities affected by natural disasters throughout the world.  He is a member of the core team for Random Hacks of Kindness on behalf of Microsoft and is one of the lead organizers of the Humanitarian Toolbox initiative.\n\nHe now spends seemingly equal amounts of time in making presentations at work and writing code at home and at work with a technical focus on user experience (UX) of mobile, web and desktop applications and the architecture of the large cloud applications they depend on.  Beyond work, Tony is always looking forward to volunteering to help non-profits leverage angle brackets, semi-colons and command line switches.","headshotUrl":"/images/speakers/tony_surma.jpg"}],"begins":"2013-07-24T17:15:00.0000000-04:00","ends":"2013-07-24T18:15:00.0000000-04:00","location":"","vimeoId":""},{"id":41,"title":"Versions are evil - Doing without them in your http API","abstract":"People change. And when you don't recognize them anymore, sometimes you'd be right in thinking they're just not the same person. APIs are the same, adding a version is the hard drug of web APIs, the first hit is free but you're going to pay later! We'll explore in practice what is wrong with versioning, and how we can manage change in our APIs over time without the need for them.","speakers":[{"id":17,"name":"Sebastien Lambla","twitterHandle":"serialseb","bio":"Sebastien Lambla runs Caffeine IT, a consultancy helping clients from all over Europe implement first-grade and nnovative solutions, from brushing up software design skills to implementing enterprise-ready resource-oriented architectures. In his spare time, Sebastien writes a book on ReST, contributes to OSS projects, and is still in a secret love affair with javascript and nodejs.","headshotUrl":"/images/speakers/sebastien_lambla.jpg"}],"begins":"2013-07-24T17:15:00.0000000-04:00","ends":"2013-07-24T18:15:00.0000000-04:00","location":"","vimeoId":""},{"id":42,"title":"Using IronRuby for embedded scripting in MonoMac","abstract":"IronRuby, an open source implementation of Ruby built on the Dynamic Language Runtime, can be used to add sophisticated scripting capabilties to a Xamarin.Mac application that is written in C#.  This talk will show how to embed IronRuby in a MonoMac application and demonstrate techniques for facilitating communication between IronRuby and C# code. It will also highlight powerful Ruby features that you can use to build internal domain-specific languages for application scripting.","speakers":[{"id":11,"name":"Ryan Paul","twitterHandle":"segphault","bio":"Ryan Paul is a Developer Evangelist at Xamarin, a startup dedicated to building better mobile development tools. Ryan is also a Linux enthusiast and open source software developer. Prior to joining Xamarin, he was a contributing editor at Ars Technica, where he wrote articles about software development. Ryan spends his free time stockpiling ammunition in preparation for the inevitable Roomba insurrection.","headshotUrl":"/images/speakers/ryan.jpg"}],"begins":"2013-07-25T09:00:00.0000000-04:00","ends":"2013-07-25T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":43,"title":"Simple.Web 101","abstract":"A high-speed introduction to a fast, light, non-blocking .NET/Mono web framework. Founded on the principle that MVC is a \"broken\" pattern, Simple.Web applies the SOLID design principles to web application development, and makes building web sites and APIs an experience of the deepest joy. Or your money back!*\n\nWatch as a full application is thrown together in a one hour talk. Play buzz-word bingo as Mark mentions async, REST and hypermedia, sometimes in a single sentence. Or sit at the back of the room saying \"ServiceStack can do that\". The choice is yours.\n\n* Money-back guarantee may be** a lie.\n\n** Is definitely.","speakers":[{"id":36,"name":"Mark Rendle","twitterHandle":"markrendle","bio":"Mark is the founder and CTO of Oort Corporation, a new company building cloud-based software for people who build cloud-based software. Oort's first product, Zudio, a Windows Azure Storage toolkit, is currently in public preview and will be fully launching in April 2013.\n\nMark's career in software design and development spans three decades and more programming languages than he cares to remember. C# has been his favourite language pretty much since the first public beta, when you had to write the code in a text editor and compile it on the command line. Those were the days. You kids today, with your IntelliSense™ and your ReSharpers, don’t know you’re born…\n\nIn his spare time, Mark work's on the Simple.Data not-an-ORM and Simple.Web projects, and wanders the world speaking at conferences and user groups. Or he just geeks out learning new programming languages and frameworks; in 2013 he's working a lot with TypeScript and AngularJS.\n\nMark is currently in his third year as a Windows Azure Development MVP.","headshotUrl":"/images/speakers/mark_rendle.jpg"}],"begins":"2013-07-25T09:00:00.0000000-04:00","ends":"2013-07-25T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":44,"title":"How to fail an OSS project in a few simple steps","abstract":"So, you've written some code and you really don't want to bother with the fame, skinny jeans don't fit you or you just don't want to deal with those pesky users. In this session, and based on more than 6 years experience in open-source, I'll give you a few simple steps to follow to make sure no one uses your software, no one helps you build it and it never ever becomes a success.","speakers":[{"id":17,"name":"Sebastien Lambla","twitterHandle":"serialseb","bio":"Sebastien Lambla runs Caffeine IT, a consultancy helping clients from all over Europe implement first-grade and nnovative solutions, from brushing up software design skills to implementing enterprise-ready resource-oriented architectures. In his spare time, Sebastien writes a book on ReST, contributes to OSS projects, and is still in a secret love affair with javascript and nodejs.","headshotUrl":"/images/speakers/sebastien_lambla.jpg"}],"begins":"2013-07-25T10:15:00.0000000-04:00","ends":"2013-07-25T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":45,"title":"A Service Oriented ViewModel","abstract":"Building on top of ServiceStack we will look at a reusable ViewModel implementation that populates properties and sends updates via web services. We will look at subtle problems that can arise due to the asynchronous nature of service requests while taking advantage of the existing INotifyPropertyChanged interface. As a bonus, property implementations will not be littered with PropertyChanged calls. And, of course, we won't forget to update the UI on the UI thread.","speakers":[{"id":37,"name":"Jacob Foshee","twitterHandle":"82unpluggd","bio":"Jacob Foshee is a cross-platform C# developer working in the medical and geoscience industries. He is passionate about enabling users to work on their own terms by leveraging “cloud” technologies.","headshotUrl":"/images/speakers/jacob_foshee.jpg"}],"begins":"2013-07-25T10:15:00.0000000-04:00","ends":"2013-07-25T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":46,"title":"Multi-language cross platform programming with .NET and Mono","abstract":"In an ideal world, you could use one language for the entire project. Unfortunately, that's not always possible. Fortunately, C# makes this integration fairly easy. In this talk, we'll investigate the how you can use C# to integrate with Java, C++ and JavaScript. We'll explore this in the context of a real world problem and we'll do it in a way that works across platforms for Mono and .NET.","speakers":[{"id":38,"name":"Tom Philpot","twitterHandle":"tjphilpot","bio":"Tom Philpot has been programming professionally since 2000 and has worked for Logos Bible Software since 2009. Initially an enterprise Java developer, Tom is currently focusing on Objective-C and C# development. Most recently, he's been using embedded Mono on the Mac version of Logos Bible Software.","headshotUrl":"/images/speakers/tom_philpot.jpg"}],"begins":"2013-07-25T11:30:00.0000000-04:00","ends":"2013-07-25T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":47,"title":"Backgrounding/Multitasking in Mobile","abstract":"Background processing, or Multitasking in Mobile Applications is far different than multitasking in desktop apps. In this session we'll take a look at what that means in iOS and Android. We'll examine the various approaches to multitasking in both platforms, as well as recommendations and guidelines for when to use which.","speakers":[{"id":39,"name":"Bryan Costanich","twitterHandle":"bryancostanich","bio":"Bryan Costanich is the Director of Education at Xamarin, makers of Xamarin.iOS and Xamarin.Android and the official shepherd's of the Mono project. He's a former Microsoft Architect, published author and renowned software architect. He's also a mobile development expert. In addition to having published to the Apple App Store, his recent project, MuveMusic, which runs on Android is the fastest growing music subscription service on the planet. When not working in tech, you can find Bryan monkeying around in Hollywood, or out in the mountains.","headshotUrl":"/images/speakers/bryan_costanich.jpg"}],"begins":"2013-07-25T11:30:00.0000000-04:00","ends":"2013-07-25T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":48,"title":"Lunch","abstract":"","speakers":[],"begins":"2013-07-25T12:30:00.0000000-04:00","ends":"2013-07-25T13:30:00.0000000-04:00","location":"","vimeoId":""},{"id":49,"title":"Cross-platform Mobile Application Architecture with Xamarin","abstract":"Share code across iOS, Android and Windows platforms using portable class libraries and file linking to maximize re-use and still take advantage of native platform features. See how real-world applications are structured and learn how you can apply those principles to your mobile apps.","speakers":[{"id":40,"name":"Craig Dunn","twitterHandle":"conceptdev","bio":"Craig is a technical writer & developer evangelist at Xamarin. He fell in love with the very early betas of MonoTouch, blogged about it, wrote a book on it, then used it on large mobile projects in the wild before joining Xamarin.","headshotUrl":"/images/speakers/craig_dunn.jpg"}],"begins":"2013-07-25T13:30:00.0000000-04:00","ends":"2013-07-25T14:30:00.0000000-04:00","location":"","vimeoId":""},{"id":50,"title":"Dead simple persistent connection client/server programming with MindTouch.Clacks","abstract":"MindTouch.Clacks is an Apache licensed cross-platform toolkit for building fast smtp/memcache style clients and servers in C#. Rather than requiring complex frameworks and boilerplate, Clacks servers and clients are built by fluently defining commands and attaching lambdas for handling requests and responses. Clacks uses an ASCII/binary protocol inspired by memcache and can easily handle thousands of requests per second. In this talk we will build a client/server application from scratch, show how other technology stacks can easily interoperate with this server, and show how MindTouch uses Clacks in production for its cloud based self-service help center and knowledge-as-a-service platform.","speakers":[{"id":41,"name":"Arne Claassen","twitterHandle":"sdether","bio":"Arne Claassen is a senior software developer at MindTouch and the lead developer for Dream, MindTouch's open source REST framework and MindTouch Clacks, MindTouch's open source RPC toolkit. Arne has been involved with large scale web applications and distributed systems for over 12 years and has been a C# developer for the last 9 years. His particular areas of interest building distributed and asynchronous system and how to make it writing code that scales over multiple processors and servers more accessible and intuitive.","headshotUrl":"/images/speakers/arne_claassen.jpg"}],"begins":"2013-07-25T13:30:00.0000000-04:00","ends":"2013-07-25T14:30:00.0000000-04:00","location":"","vimeoId":""},{"id":51,"title":"Cross-Platform Mobile Architectural Patterns","abstract":"If you want high levels of code reuse across platforms, small amounts of architectural discipline provide great benefits. Once you've gone down the wrong path, it's much more difficult to re-architect your way out of trouble. This talk will discuss some fundamental patterns for increasing code modularity but will concentrate on higher-level architectural patterns such as MVC, MVP, MVVM, and DCI. Attendees will see how these patterns map to API concepts in iOS and Android. Some cross-platform libraries will be specifically discussed, but the emphasis of the talk will be on higher-level architectural topics.","speakers":[{"id":42,"name":"Larry O'Brien","twitterHandle":"lobrien","bio":"Larry O'Brien is a Developer Evangelist for Xamarin. He sold his first program at age 16 and has been an influential voice in the software engineering community since 1989. He edited Computer Language, AI Expert, Software Development, and Game Developer magazines, founded the Jolt Programming Awards, and has written the \"Codewatch\" columnist for SD Times since 2001. Three times, he architected the core component for a company that subsequently scaled from single-millions to >$100M sales. His programs have appeared in National Geographic Magazine, been collected in the permanent design collection of the New York Museum of Modern Art, and have transacted more than $6B over the course of the last decade.","headshotUrl":"/images/speakers/larry_obrien.jpg"}],"begins":"2013-07-25T14:45:00.0000000-04:00","ends":"2013-07-25T15:45:00.0000000-04:00","location":"","vimeoId":""},{"id":52,"title":"Server-side Mono: How Ready Is It?","abstract":"Mono is clearly a great choice for mobile and desktop apps, but is it ready for the server room?\n\nDavid Mitchell, a development lead at Logos Bible Software, will present the results of his team's recent experiments in migrating existing web services from .NET and IIS to Mono and Linux. While benchmarks will be included, the talk will primarily focus on the potential pitfalls and workarounds for operating in a mixed .NET/Mono environment, as well as the reasons one might even attempt such a thing in the first place.","speakers":[{"id":43,"name":"David Mitchell","twitterHandle":"theDMitchell","bio":"David is a development lead at Logos Bible Software, where he spearheaded the effort to port the company's flagship product to the Mac using Mono. Currently, he maintains a set of services that allow the company's customers to sync their data across a variety of devices and applications.","headshotUrl":"/images/speakers/david_mitchell.jpg"}],"begins":"2013-07-25T14:45:00.0000000-04:00","ends":"2013-07-25T15:45:00.0000000-04:00","location":"","vimeoId":""},{"id":53,"title":"Git More Done","abstract":"Rarely does a month go by that I don't stumble on some feature or option in Git that could have been brought to my attention yesterday. Building on your day-to-day understanding of Git, this session will share a plethora of real-world productivity tips, from useful config settings and aliases to power tools like interactive rebase with autosquash, patchwise add, reflog and bisect.","speakers":[{"id":44,"name":"Keith Dahlby","twitterHandle":"dahlbyk","bio":"Keith Dahlby is a new father, web developer, Git enthusiast, language geek and three-time C# MVP from Cedar Rapids, IA. By day he sells motorcycle parts at J&P Cycles; by night he sometimes blogs with Los Techies. His open source efforts include posh-git, a Git environment for PowerShell; and FSRazor, F# support for the Razor view engine. He's also an active contributor to LibGit2Sharp, used by GitHub for Windows and Git for Visual Studio. Keith has spoken at community events around the Midwest and studied Human-Computer Interaction at Iowa State University. His talks have been described as “terrific!”, “very interactive!”, and “the best I’ve seen all hour!”.","headshotUrl":"/images/speakers/keith_dahlby.jpg"}],"begins":"2013-07-25T16:00:00.0000000-04:00","ends":"2013-07-25T17:00:00.0000000-04:00","location":"","vimeoId":""}]