[{"id":0,"name":"Chris Hardy","twitterHandle":"chrisntr","bio":"Chris Hardy, a Microsoft ASPInsider, is an .NET consultant focusing on MonoTouch and Mono for Android development.\n\nEver since MonoTouch was in beta, Chris has been developing and evangelising MonoTouch and Mono for Android and was one of the first users to get a MonoTouch application on to the App Store. Speaking at conferences around the world on the subject, Chris has been a key part of the community and extended this by contributing to MonoTouch and Mono for Android books.","headshotUrl":"/images/speakers/chris.jpg"},{"id":1,"name":"Demis Bellot","twitterHandle":"demisbellot","bio":"Demis Bellot is a developer at Stack Exchange where he maintains StackOverflow Careers 2.0 Back Office Web & MQ services built on ServiceStack - an Open Source, high-performance, cross-platform Web Services framework. ServiceStack includes a number of lean components for developing high-performance web services, including: .NET's fastest JSON and text serializers, leading C# RedisClient, One of .NET's fastest POCO-based Micro ORMS, Caching, Session, Logging & authentication providers as well a node.js powered css, less, sass, coffeescript & js minifier & bundler.","headshotUrl":"/images/speakers/demis.jpg"},{"id":2,"name":"Frank Krueger","twitterHandle":"praeclarum","bio":"Frank has been programming professionally for 14 years with most of that time spent on the Windows platform but now spends his time on the Mono Platform. He has rejected his Electrical Engineering education and focuses today on mobile app and web app development using a variety of platforms. Past projects include embedded engine management system development, scientific simulators, tooling for graphics and game developers, online retail, and control software for naval ships. He runs a small consulting business in Seattle, WA that enables him to work on a variety of projects in a variety of industries. Today he is most excited about the mobile platform and opportunities for advancing the state of the art of the human-machine interface.","headshotUrl":"/images/speakers/frank.jpg"},{"id":3,"name":"Greg Shackles","twitterHandle":"gshackles","bio":"Greg Shackles is a Senior Software Engineer at OLO Online Ordering, based in New York City. His book, Mobile Development with C#, published by O'Reilly, covers how to get started building iOS, Android and Windows Phone apps with C#. As an active member of the community, Greg speaks regularly at many user groups and developer events, and is also a co-author of a monthly Mono for Android column for Visual Studio Magazine.\n\nOutside of technology, Greg is obsessed with heavy metal, baseball, and craft beer, sometimes in combination, as well as an aspiring homebrewer.","headshotUrl":"/images/speakers/greg.jpg"},{"id":4,"name":"James Avery","twitterHandle":"averyj","bio":"James is the founder and CEO of Adzerk, a next generation ad platform that brings simplicity and power to publishers and networks. James serves as an advisor to Max Foundry, DotNetKicks, and Epic Win Hosting. He previously co-founded Tekpub (a popular destination for developer screencasts) and Zerk Media (parent company of The Lounge and Ruby Row ad networks). James has been writing code and starting companies for the last 10 years, and has also written books for O’Reilly, Wrox, and Microsoft Press.","headshotUrl":"/images/speakers/james.jpg"},{"id":5,"name":"Jb Evain","twitterHandle":"jbevain","bio":"Jb is the founder of SyntaxTree, a developer tools company. He's the author of Mono.Cecil, a widely used library in the .net ecosystem, and a long time Mono contributor. He has a soft spot for programming languages, compilers, decompilers and tools alike.","headshotUrl":"/images/speakers/jb.jpg"},{"id":6,"name":"Jeroen Frijters","twitterHandle":"jeroenfrijters","bio":"Jeroen is the co-founder of Sumatra Software b.v. and the founder of the IKVM.NET project. He likes to develop in C#, write cranky blog posts, find security vulnerabilities and spelunk the internals of the JVM and CLR.","headshotUrl":"/images/speakers/jeroen.jpg"},{"id":7,"name":"Phil Haack","twitterHandle":"haacked","bio":"Phil Haack (yes, it's pronounced \"hack\") works at GitHub finding ways to make it better for .NET and Windows developers everywhere. Prior to GitHub, he was a senior Program Manager at Microsoft responsible for shipping ASP.NET MVC, NuGet, among other projects.","headshotUrl":"/images/speakers/phil.jpg"},{"id":8,"name":"Dean Ellis","twitterHandle":"infspacestudios","bio":"Dean Ellis has been a software engineer for the last 15 years. He currently works for Aurora Computer Services Ltd developing and maintaining Face Recongnition Kiosks using C# .Net and Mono as well as developing desktop, web and mobile based softare solutions.\n\nIn his spare time he is one of the project coordinators and a contributor to MonoGame an open source, multi platform implementation of XNA.","headshotUrl":"/images/speakers/dean.jpg"},{"id":9,"name":"John Zablocki","twitterHandle":"codevoyeur","bio":"John Zablocki is a Developer Advocate at Couchbase, where he is responsible for developing the Couchbase Client Library for .NET. He is the organizer of Beantown ALT.NET , a former adjunct at Fairfield University, and an author for O’Reilly. John holds an M.S. in Computer Science from Rensselaer Hartford. He has worked at startups throughout his career and is interested in the intersection of .NET and open source. Online, John can be found at http://johnzablocki.com. Offline, he can be found too infrequently around Boston, with his dog, daughter, and his Fender Telecaster.","headshotUrl":"/images/speakers/john_zablocki.jpg"},{"id":10,"name":"Miguel de Icaza","twitterHandle":"migueldeicaza","bio":"Miguel has directed the Mono project since its creation in 2001 and oversaw the launches of Mono's desktop, server and mobile offerings at Novell. Before Mono he started writing free software in 1992 and co-founded the GNOME project in 1997. In 1999 Miguel co-founded Ximian with Nat. He also worked on the Midnight Commander file manager, Gnumeric, and the Linux kernel. He serves as an advisor at Stack Exchange. He has received the Free Software Foundation 1999 Free Software Award, the MIT Technology Review Innovator of the Year Award in 1999, and was named one of Time Magazine's 100 innovators for the new century in September 2000.","headshotUrl":"/images/speakers/miguel.jpg"},{"id":11,"name":"Aaron Bockover","twitterHandle":"abock","bio":"Aaron works at Rdio on the common C# core that powers their Android, iOS, and Windows Phone applications. In March he started the Vernacular project with the goal of easing localization pain for mobile application developers while at the same time enhancing localization support for users. Prior to Rdio, Aaron worked at Novell creating and maintaining the popular Banshee Media Player desktop application and working extensively in openSUSE, Moblin, and MeeGo.\n\nAaron has been a developer, user, and advocate of Mono since 2002, but perhaps Aaron's most important contribution to the universe has been CatOverflow.com. Aaron is a world renowned pork, beer, and whisky connoisseur.","headshotUrl":"/images/speakers/aaron.jpg"},{"id":12,"name":"John Bubriski","twitterHandle":"johnbubriski","bio":"John has worked tirelessly with C# and .NET, but likes working outside the (Microsoft) box too.  John enjoys using non-Microsoft loves Visual Studio and the CLR, but enjoys using other libraries and languages.  Outside work John and his beautiful wife raise a 2 year old son and a 2 month old daughter.  In his free time, John works with a friend building indie games.","headshotUrl":"/images/speakers/john_bubriski.jpg"},{"id":13,"name":"Paul Betts","twitterHandle":"xpaulbettsx","bio":"I'm a Windows ⁄ .NET Hacker for GitHub who graduated from The Ohio State University. In my spare time, I hack on some open–source software, play guitar and bass, and in general am within ε of really awesome.","headshotUrl":"/images/speakers/paul.jpg"},{"id":14,"name":"Louis DeJardin","twitterHandle":"@loudej","bio":"Louis DeJardin works at Microsoft on the web team and is an active member of the OWIN specification working group. Prior to that he worked at Dow Jones creating real-time web-based systems and is the author of the Spark view engine.","headshotUrl":"/images/speakers/louis.jpg"},{"id":15,"name":"Scott Olson","twitterHandle":"vagabondrev","bio":"Scott Olson has spent the past 19 years building software and advising our clients on the potential of software and mobility. He is the author of Professional Cross-Platform Mobile Development in C#, (Wrox 2012), a contributing writer for iPhone Life magazine, and a thought leader in enterprise mobility. Throughout his career Scott has worked with many of the Fortune 500 companies including Best Buy, Target Corporation, Medtronic, and Prudential Financial. He believes that mobility has the power to transform the enterprise, and will change the way companies write and use software.","headshotUrl":"/images/speakers/scott.jpg"},{"id":16,"name":"Igor Moochnick","twitterHandle":"igor_moochnick","bio":"Igor has been building enterprise cross-platform and cross-technology distributed systems for more than 20 years. He is passionate about all the technologies and methodologies that can enable applications to scale seamlessly, to process large amounts of data, and to serve more users. With cloud technologies becoming widely available and advances in the virtualization space, he is using his expertise to help BlueMetal Architects’ clients modernize their applications and infrastructure, and scale them in private and public clouds. In his spare time he geeks out on Big Data and Robotics, and is a frequent speaker and supporter at multiple code camps and events in the New England user group community.","headshotUrl":"/images/speakers/igor.jpg"},{"id":17,"name":"Jérémie Laval","twitterHandle":"jeremie_laval","bio":"French guy, Xamarin hacker, I have been in the Mono scene for a long time, working on the various open-source part of the project. These days, I'm working on improving our developer experience for MonoTouch and Mono for Android.","headshotUrl":"/images/speakers/jeremie.jpg"},{"id":18,"name":"Ananth Balasubramaniam","twitterHandle":"ananthonline","bio":"I am a graphics/language/parallel-computing geek who has written more rendering engines than I can keep track of (although not always for games). I love C# and the .NET/Mono frameworks deeply and have done things with them that are completely off the beaten track. I have recently begun taking an interest in cross-platform game (engine) development including mobile platforms, especially using Mono because of the broad reach and ease-of-use that runtime enables.","headshotUrl":"/images/speakers/ananth.jpg"},{"id":19,"name":"Bob Familiar","twitterHandle":"bobfamiliar","bio":"Bob Familiar is Director of Technical Evangelism for Microsoft DPE East Region. The Technical Evangelism team works with students and professional developers to help them learn, adopt and use the Microsoft developer platform to design, build and deploy games and apps for the phone, cloud and Windows.","headshotUrl":"/images/speakers/bob.jpg"},{"id":20,"name":"Michael Hutchinson","twitterHandle":"mjhutchinson","bio":"Michael has been working on the open-source MonoDevelop IDE and other projects in the Mono ecosystem since taking part in the 2005 Summer of Code. In 2007 he joined Novell, where he was responsible for IDE tooling for web, mobile and Mac technologies such as ASP.NET, MonoTouch, Mono for Android and MonoMac. At Xamarin, he continues to work on making MonoDevelop a first-class development experience.","headshotUrl":"/images/speakers/michael.jpg"},{"id":21,"name":"Jonathan Chambers","twitterHandle":"jon_cham","bio":"Jonathan works at Unity Technologies making mono do awesome things within the Unity3d game engine. He's been a long time mono contributor, focusing primarily on Windows support within mono. Prior to joining Unity, Jonathan worked at Ansys delivering engineering simulation software across a variety of platforms.","headshotUrl":"/images/speakers/jonathan.jpg"},{"id":22,"name":"Somya Jain","twitterHandle":"somya_j","bio":"After 11 years as an enterprise software developer/tech lead/architect, I am now a freelance mobile developer (iOS, Android & Windows Phone), based in New York City. I focus on multi-platform mobile apps. Several apps that I have worked on, have been featured on the app store, with one making it into the top 10 free apps.","headshotUrl":"/images/speakers/somya.jpg"},{"id":23,"name":"Steve Millar","twitterHandle":"samillar77","bio":"Steve Millar is the founder of Infinitek, an independent software development shop specializing in distributed systems using the .Net stack.  He has a passion for writing code and for learning new technologies by coming up with fun projects that need software to make them go.","headshotUrl":"/images/speakers/steve.jpg"},{"id":24,"name":"David Gerding","twitterHandle":"davidgerding","bio":"David Gerding, MBA, is an associate professor in the Department of Interactive Arts & Media at Columbia College Chicago.   Professor Gerding is a McCarthy Technologies certified team and collaboration skills facilitator, a Microsoft Certified Systems Engineer and a co-author of the programming text “ASP.NET Namespace Reference” by WROX Publishers (2002). His consulting clients over the years have included both consulting firms like McKinsey Company, Sanwa Bank, DFC Intelligence and McCarthy Technologies as well as small to mid-size enterprises and startups in a variety of markets.  Professor Gerding has served as principal investigator of a series of large federally funded cooperative agreements with the US Army Research Lab investigating sensor fusion applications in social contexts.","headshotUrl":"/images/speakers/dave.jpg"},{"id":25,"name":"Sam Lippert","twitterHandle":"lippertz","bio":"Sam is a programmer with proficiencies in .NET and Java. Since 2007, he’s been involved in team projects utilizing these technologies, both as a leader and participant. He has consulted for clients such as C. H. Robinson, 3M, and Medtronic, working closely with their developers and business analysts. He has contributed to thought leadership in the field of cross-platform mobility architecture by contributing to Android.Dialog, and to the MonoCross project in extending it to WPF and by making formative changes to its Android target. He is acknowledged in the book Cross-Platform Mobile Development in C#, which utilizes this work.","headshotUrl":"/images/speakers/sam.jpg"},{"id":26,"name":"Don Syme","twitterHandle":"dsyme","bio":"Don Syme is a Principal Researcher at Microsoft Research, UK. He has worked on both C# and F#, including initiating .NET Generics, F# type providers and language-integrated async programming in F# and C#. He’s an advocate of functional-first strongly-typed programming, and is fan of all initiatives that make programming simpler and better.","headshotUrl":"/images/speakers/don.jpg"}]